repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F4/HAL.cpp
/*
    This file is part of Repetier-Firmware.

    Repetier-Firmware is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    Repetier-Firmware is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with Repetier-Firmware.  If not, see <http://www.gnu.org/licenses/>.

    This firmware is a nearly complete rewrite of the sprinter firmware
    by kliment (https://github.com/kliment/Sprinter)
    which based on Tonokip RepRap firmware rewrite based off of Hydra-mmm firmware.



    Main author: repetier

*/

#include "Repetier.h"
#ifdef STM32F4_BOARD
#include <stm32f4xx_hal.h>
#include <malloc.h>

// Create timer names from TIMER_NUM macro

#define _TIMER(num) TIM##num
#define _TIMER_IRQ(num) TIM##num##_IRQn
#define _TIMER_VECTOR(num) RAW_TIM##num##_IRQHandler(void)
#define _TIMER_VECTOR_NAME(num) RAW_TIM##num##_IRQHandler

#define TIMER(num) _TIMER(num)
#define TIMER_IRQ(num) _TIMER_IRQ(num)
#define TIMER_VECTOR(num) _TIMER_VECTOR(num)
#define TIMER_VECTOR_NAME(num) _TIMER_VECTOR_NAME(num)

// Adds output signals to pins below to measure interrupt timings
// with a logic analyser. Set to 0 for production!
// Pins set to -1 will not enable the check. Use pins unused by other function on your printer!
#define DEBUG_TIMING 0
#define DEBUG_ISR_STEPPER_PIN PB6 // PD12
#define DEBUG_ISR_MOTION_PIN PC0  // PD13
#define DEBUG_ISR_TEMP_PIN PD5    // PD14/PWM1
#define DEBUG_ISR_ANALOG_PIN -1   // PD15/PWM2
#define DEBUG_ISR_TONE_PIN PD6    // PD15/PWM2

//extern "C" void __cxa_pure_virtual() { }
extern "C" char* sbrk(int i);

char HAL::virtualEeprom[EEPROM_BYTES] = { 0 };
bool HAL::wdPinged = true;
uint8_t HAL::i2cError = 0;
BootReason HAL::startReason = BootReason::UNKNOWN;

enum class TimerUsage {
    UNUSED,
    INTERRUPT_TIMER,
    PWM_TIMER
};

struct TimerFunction {
    TIM_TypeDef* tim;
    int num;
    TimerUsage usage;
    uint32_t frequency;
    uint32_t reserved;
    HardwareTimer* timer;
};

struct PWMEntry {
    TimerFunction* function;
    const PinMap* map;
    HardwareTimer* ht;
};
static PWMEntry pwmEntries[40];
static int numPWMEntries = 0;

TimerFunction timerList[] = {
#ifdef TIM1
#define TIM1_COUNT 1
    { TIM1, 1, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM1_COUNT 2
#endif
#ifdef TIM2
#define TIM2_COUNT 1
    ,
    { TIM2, 2, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM2_COUNT 0
#endif
#ifdef TIM3
#define TIM3_COUNT 1
    ,
    { TIM3, 3, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM3_COUNT 0
#endif
#ifdef TIM4
#define TIM4_COUNT 1
    ,
    { TIM4, 4, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM4_COUNT 0
#endif
#ifdef TIM5
#define TIM5_COUNT 1
    ,
    { TIM5, 5, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM5_COUNT 0
#endif
#ifdef TIM6
#define TIM6_COUNT 1
    ,
    { TIM6, 6, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM6_COUNT 0
#endif
#ifdef TIM7
#define TIM7_COUNT 1
    ,
    { TIM7, 7, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM7_COUNT 0
#endif
#ifdef TIM8
#define TIM8_COUNT 1
    ,
    { TIM8, 8, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM8_COUNT 0
#endif
#ifdef TIM9
#define TIM9_COUNT 1
    ,
    { TIM9, 9, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM9_COUNT 0
#endif
#ifdef TIM10
#define TIM10_COUNT 1
    ,
    { TIM2, 10, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM10_COUNT 0
#endif
#ifdef TIM11
#define TIM11_COUNT 1
    ,
    { TIM11, 11, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM11_COUNT 0
#endif
#ifdef TIM12
#define TIM12_COUNT 1
    ,
    { TIM12, 12, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM12_COUNT 0
#endif
#ifdef TIM13
#define TIM13_COUNT 1
    ,
    { TIM13, 13, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM13_COUNT 0
#endif
#ifdef TIM14
#define TIM14_COUNT 1
    ,
    { TIM14, 14, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM14_COUNT 0
#endif
#ifdef TIM15
#define TIM15_COUNT 1
    ,
    { TIM15, 15, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM15_COUNT 0
#endif
#ifdef TIM16
#define TIM16_COUNT 1
    ,
    { TIM16, 16, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM16_COUNT 0
#endif
#ifdef TIM17
#define TIM17_COUNT 1
    ,
    { TIM17, 17, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM17_COUNT 0
#endif
#ifdef TIM18
#define TIM18_COUNT 1
    ,
    { TIM18, 18, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM18_COUNT 0
#endif
#ifdef TIM19
#define TIM19_COUNT 1
    ,
    { TIM19, 19, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM19_COUNT 0
#endif
#ifdef TIM20
#define TIM20_COUNT 1
    ,
    { TIM20, 20, TimerUsage::UNUSED, 0, 0, nullptr }
#else
#define TIM20_COUNT 0
#endif
};

#define NUM_TIMERS (TIM1_COUNT + TIM2_COUNT + TIM3_COUNT + TIM4_COUNT + TIM5_COUNT + TIM6_COUNT + TIM7_COUNT + TIM8_COUNT + TIM9_COUNT + TIM10_COUNT + TIM11_COUNT + TIM12_COUNT + TIM13_COUNT + TIM14_COUNT + TIM15_COUNT + TIM16_COUNT + TIM17_COUNT + TIM18_COUNT + TIM19_COUNT + TIM20_COUNT)

TimerFunction* reserveTimerInterrupt(int num) {
    for (int i = 0; i < NUM_TIMERS; i++) {
        if (timerList[i].num == num) {
            timerList[i].usage = TimerUsage::INTERRUPT_TIMER;
            return &timerList[i];
        }
    }
    return nullptr;
}

HAL::HAL() {
    //ctor
}

HAL::~HAL() {
    //dtor
}
TimerFunction* motion2;
TimerFunction* motion3;
TimerFunction* pwm;
TimerFunction* servo;
TimerFunction* toneTimer = nullptr;
extern "C" void TIMER_VECTOR(MOTION2_TIMER_NUM);
extern "C" void TIMER_VECTOR(MOTION3_TIMER_NUM);
extern "C" void TIMER_VECTOR(PWM_TIMER_NUM);
extern "C" void TIMER_VECTOR(TONE_TIMER_NUM);

#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
extern void servoOffTimer();
extern void toneOnTimer();
extern void toneOffTimer();
extern "C" void TIMER_VECTOR(SERVO_TIMER_NUM);
static uint32_t ServoPrescalerfactor = 20000;
static uint32_t Servo2500 = 2500;
#endif
void HAL::hwSetup(void) {
    updateStartReason();
#if DEBUG_TIMING
#if defined(DEBUG_ISR_STEPPER_PIN) && DEBUG_ISR_STEPPER_PIN >= 0
    SET_OUTPUT(DEBUG_ISR_STEPPER_PIN);
#endif
#if defined(DEBUG_ISR_MOTION_PIN) && DEBUG_ISR_MOTION_PIN >= 0
    SET_OUTPUT(DEBUG_ISR_MOTION_PIN);
#endif
#if defined(DEBUG_ISR_TEMP_PIN) && DEBUG_ISR_TEMP_PIN >= 0
    SET_OUTPUT(DEBUG_ISR_TEMP_PIN);
#endif
#if defined(DEBUG_ISR_ANALOG_PIN) && DEBUG_ISR_ANALOG_PIN >= 0
    SET_OUTPUT(DEBUG_ISR_ANALOG_PIN);
#endif
#if defined(DEBUG_ISR_TONE_PIN) && DEBUG_ISR_TONE_PIN >= 0
    SET_OUTPUT(DEBUG_ISR_TONE_PIN);
#endif
#endif
    // Servo control
#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
    servo = reserveTimerInterrupt(SERVO_TIMER_NUM); // prevent pwm usage
    servo->timer = new HardwareTimer(TIMER(SERVO_TIMER_NUM));
    // servo->timer->setMode(1, TIMER_DISABLED, NC);
    servo->timer->setOverflow(200, HERTZ_FORMAT);

    LL_TIM_OC_EnableFast(TIMER(SERVO_TIMER_NUM), servo->timer->getLLChannel(1));
    LL_TIM_OC_EnablePreload(TIMER(SERVO_TIMER_NUM), servo->timer->getLLChannel(1));

    servo->timer->attachInterrupt(TIMER_VECTOR_NAME(SERVO_TIMER_NUM));
    servo->timer->attachInterrupt(1, &servoOffTimer); // called on compare match
    servo->timer->refresh();
    servo->timer->resume();

    ServoPrescalerfactor = (LL_TIM_GetPrescaler(servo->tim) + 1);
    Servo2500 = ((2500 * (servo->timer->getTimerClkFreq() / 1000000)) / ServoPrescalerfactor) - 1;
    HAL_NVIC_SetPriority(TIMER_IRQ(SERVO_TIMER_NUM), 3, 0);
#endif
#if defined(TWI_CLOCK_FREQ) && TWI_CLOCK_FREQ > 0 //init i2c if we have a frequency
    HAL::i2cInit(TWI_CLOCK_FREQ);
#endif
    // make debugging startup easier
    //Serial.begin(115200);

#if EEPROM_AVAILABLE && EEPROM_MODE != EEPROM_NONE && EEPROM_AVAILABLE != EEPROM_SDCARD && EEPROM_AVAILABLE != EEPROM_FLASH
    // Copy eeprom to ram for faster access
    int i;
    for (i = 0; i < EEPROM_BYTES; i += 4) {
        eeval_t v = eprGetValue(i, 4);
        memcopy4(&virtualEeprom[i], &v.i);
    }
#else
    memset(virtualEeprom, 0, EEPROM_BYTES);
#endif
#if EEPROM_AVAILABLE == EEPROM_FLASH && EEPROM_MODE != EEPROM_NONE
    FEInit();
#endif
}

// Set up all timer interrupts
void HAL::setupTimer() {
    /*!< 4 bits for pre-emption priority (0-15) 0 bits for subpriority */
    HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
    motion2 = reserveTimerInterrupt(MOTION2_TIMER_NUM); // prevent pwm usage
    motion2->timer = new HardwareTimer(TIMER(MOTION2_TIMER_NUM));
    // motion2->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion2->timer->setOverflow(PREPARE_FREQUENCY, HERTZ_FORMAT);
    motion2->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION2_TIMER_NUM));
    motion2->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION2_TIMER_NUM), 4, 0);

    // Regular interrupts for heater control etc

    pwm = reserveTimerInterrupt(PWM_TIMER_NUM); // prevent pwm usage
    pwm->timer = new HardwareTimer(TIMER(PWM_TIMER_NUM));
    // pwm->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    pwm->timer->setOverflow(PWM_CLOCK_FREQ, HERTZ_FORMAT);
    pwm->timer->attachInterrupt(TIMER_VECTOR_NAME(PWM_TIMER_NUM));
    pwm->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(PWM_TIMER_NUM), 2, 0);

    // Timer for stepper motor control

    motion3 = reserveTimerInterrupt(MOTION3_TIMER_NUM); // prevent pwm usage
    motion3->timer = new HardwareTimer(TIMER(MOTION3_TIMER_NUM));
    // motion3->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion3->timer->setOverflow(STEPPER_FREQUENCY, HERTZ_FORMAT);
    motion3->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION3_TIMER_NUM));
    motion3->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION3_TIMER_NUM), 0, 0); // highest priority required!

#if NUM_BEEPERS > 0
    for (int i = 0; i < NUM_BEEPERS; i++) {
        if (beepers[i]->getOutputType() == 1) {
            // If we have any SW beepers, enable the beeper IRQ
            toneTimer = reserveTimerInterrupt(TONE_TIMER_NUM); // prevent pwm usage
            toneTimer->timer = new HardwareTimer(TIMER(TONE_TIMER_NUM));
            // Timer 11 has only one channel, 1.
            toneTimer->timer->setMode(1, TIMER_OUTPUT_COMPARE, NC);
            toneTimer->timer->attachInterrupt(&toneOnTimer);
            toneTimer->timer->attachInterrupt(1, &toneOffTimer);
            // Not on by default for output_compare
            LL_TIM_OC_EnablePreload(TIMER(TONE_TIMER_NUM), toneTimer->timer->getLLChannel(1));
            LL_TIM_OC_EnableFast(TIMER(TONE_TIMER_NUM), toneTimer->timer->getLLChannel(1));
            toneTimer->timer->setInterruptPriority(2, 0);
            toneTimer->timer->refresh();
            toneTimer->timer->resume();
            break;
        }
    }
#endif
}

// Called within checkForPeriodicalActions (main loop, more or less)
// as fast as possible
void HAL::handlePeriodical() {
}

