repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F4/HAL.cpp
// Try to initialize pinNumber as hardware PWM. Returns internal
// id if it succeeds or -1 if it fails. Typical reasons to fail
// are no pwm support for that pin or an other pin uses same PWM
// channel.
int HAL::initHardwarePWM(int pinNumber, uint32_t frequency) {
    if (pinNumber < 0 || !frequency) {
        return -1;
    }
    PinName p = digitalPinToPinName(pinNumber);
    if (p != NC) {
        const PinMap* map = PinMap_PWM;
        while (map->pin != NC) {
            if (map->pin == p) {
                break;
            }
            map++;
        }
        if (map->pin != NC) {
            TimerFunction* tf = nullptr;
            for (int i = 0; i < NUM_TIMERS; i++) {
                if (timerList[i].tim == map->peripheral) {
                    tf = &timerList[i];
                    break;
                }
            }
            if (tf == nullptr || tf->usage == TimerUsage::INTERRUPT_TIMER) {
                return -1; // already used
            }
            if (tf->usage == TimerUsage::UNUSED) {
                tf->usage = TimerUsage::PWM_TIMER;
                tf->frequency = frequency;
                tf->reserved = 1;
            } else {
                tf->reserved++;
            }
            pwmEntries[numPWMEntries].function = tf;
            pwmEntries[numPWMEntries].map = map;
            // Find timer in local usage list

            TIM_TypeDef* Instance = (TIM_TypeDef*)tf->tim;
            HardwareTimer* HT;
            uint32_t index = get_timer_index(tf->tim);
            if (HardwareTimer_Handle[index] == nullptr) {
                HardwareTimer_Handle[index]->__this = new HardwareTimer((TIM_TypeDef*)map->peripheral);
            }

            HT = (HardwareTimer*)(HardwareTimer_Handle[index]->__this);
            pwmEntries[numPWMEntries].ht = HT;
            uint32_t channel = STM_PIN_CHANNEL(map->function);
            pinMode(pinNumber, OUTPUT);
            digitalWrite(pinNumber, LOW);
            // preloading on by default as of 1.9.0 (4.10900.200819)
            HT->setPWM(channel, p, tf->frequency, 0);
            HT->refresh();
            return numPWMEntries++;
        }
    }
    return -1;
}
// Set pwm output to value. id is id from initHardwarePWM.
void HAL::setHardwarePWM(int id, int value) {
    if (id < 0 || id >= 50) { // illegal id
        return;
    }
    PWMEntry& entry = pwmEntries[id];
    entry.ht->setCaptureCompare(STM_PIN_CHANNEL(entry.map->function), value, RESOLUTION_8B_COMPARE_FORMAT);
}

struct DACEntry {
    DAC_HandleTypeDef handle;
    uint8_t chan;
};

#define NUM_DACS 2u
static DACEntry dacEntries[NUM_DACS] = { 0 };
static uint8_t numDACEntries;

fast8_t HAL::initHardwareDAC(fast8_t dacPin) {
    if (numDACEntries > (NUM_DACS - 1u)) {
        return -1;
    }
    PinName p = digitalPinToPinName(dacPin);
    if (p != NC) {
        const PinMap* map = PinMap_DAC;
        while (map->pin != NC) {
            if (map->pin == p) {
                break;
            }
            map++;
        }
        if (map->pin != NC) {
            dacEntries[numDACEntries].handle.Instance = (DAC_TypeDef*)map->peripheral;
            uint8_t pinChan = STM_PIN_CHANNEL(map->function);
            dacEntries[numDACEntries].chan = (pinChan == 1u) ? DAC_CHANNEL_1 : (pinChan == 2u) ? DAC_CHANNEL_2 : 0u;

            DAC_ChannelConfTypeDef dummy = { 0ul };
            if (HAL_DAC_Init(&dacEntries[numDACEntries].handle)
                || HAL_DAC_ConfigChannel(&dacEntries[numDACEntries].handle, &dummy, dacEntries[numDACEntries].chan)) {
                return -1;
            }
            setHardwareDAC(numDACEntries, 0);
            return numDACEntries++;
        }
    }
    return -1;
}

void HAL::setHardwareDAC(fast8_t id, fast8_t value) {
    if (id < 0 || id > (static_cast<int>(NUM_DACS) - 1)) {
        return;
    }
    if (value > 255) {
        value = 255;
    }
    if (HAL_DAC_SetValue(&dacEntries[id].handle, dacEntries[id].chan, DAC_ALIGN_12B_R, (static_cast<uint32_t>(value) * 4095ul) / 255ul) != HAL_OK) {
        return;
    }
    HAL_DAC_Start(&dacEntries[id].handle, dacEntries[id].chan);
}
void HAL::setHardwareFrequency(int id, uint32_t frequency) {
    if (id < 0 || id >= 50 || !frequency) { // illegal id
        return;
    }
    pwmEntries[id].ht->setOverflow(frequency, HERTZ_FORMAT);
}

ADC_HandleTypeDef AdcHandle1 = {};
ADC_HandleTypeDef AdcHandle2 = {};
ADC_HandleTypeDef AdcHandle3 = {};
struct AnalogFunction {
    bool enabled;
    int32_t channel;
    int32_t lastValue;
    ADC_TypeDef* def;
    int32_t pin;
    int32_t dmaBufferPos;
};

// Initialize ADC channels
static AnalogFunction analogValues[MAX_ANALOG_INPUTS] = { false, -1, 0, nullptr, -1 };
static AnalogFunction* analogMap[256] = { nullptr }; // Map pin number to entry in analogValues
int numAnalogInputs = 0;
uint16_t adcData1[16] = { 0 }; // Target for DMA adc1 transfer
uint16_t adcData2[16] = { 0 }; // Target for DMA adc2 transfer
uint16_t adcData3[16] = { 0 }; // Target for DMA adc3 transfer

void reportAnalog() {
    HAL::reportHALDebug();
    for (int i = 0; i < 256; i++) {
        if (analogMap[i]) {
            Com::printF("Analog ", i);
            Com::printFLN(" = ", static_cast<int32_t>(analogMap[i]->lastValue));
        }
    }
    for (int i = 0; i < numAnalogInputs; i++) {
        AnalogFunction& af = analogValues[i];
        Com::printF("adc ", i);
        Com::printF(" channel ", af.channel);
        Com::printF(" pin ", af.pin);
        if (af.def == ADC1) {
            Com::printFLN(", ADC1, val = ", static_cast<int32_t>(adcData1[af.dmaBufferPos]));
        }
        if (af.def == ADC2) {
            Com::printFLN(", ADC2, val = ", static_cast<int32_t>(adcData2[af.dmaBufferPos]));
        }
        if (af.def == ADC3) {
            Com::printFLN(", ADC3, val = ", static_cast<int32_t>(adcData3[af.dmaBufferPos]));
        }
    }

    // Check devices
    for (uint8_t address = 2; address < 127; address++) {
        // The i2c_scanner uses the return value of
        // the Write.endTransmisstion to see if
        // a device did acknowledge to the address.
        WIRE_PORT.beginTransmission(address);
        uint8_t error = WIRE_PORT.endTransmission();

