repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F4/HAL.cpp
        if (error == 0) {
            Com::printFLN("I2Cdevice found:", (int32_t)address);
        } else if (error == 4) {
            Com::printFLN("unknown error for:", (int32_t)address);
        }
    }

    // Test eeprom
    eeval_t e1, e2;
    e1.l = 123456789;
    HAL::eprBurnValue(4000, 4, e1);
    e2 = HAL::eprGetValue(4000, 4);
    Com::printFLN("Eeprom backread", (int32_t)e2.l);
    e1.l = 987654321;
    HAL::eprBurnValue(4000, 4, e1);
    e2 = HAL::eprGetValue(4000, 4);
    Com::printFLN("Eeprom backread", (int32_t)e2.l);
}

static DMA_HandleTypeDef hdma_adc1, hdma_adc2, hdma_adc3;
int dmaInitState, dmaInitError;
int adcerror = 0, dmaerror = 0;
static int numADC1 = 0, numADC2 = 0, numADC3 = 0;

void HAL::reportHALDebug() {
    if (numADC1) {
        Com::printFLN("AdcHandle 1 state:", AdcHandle1.State);
        Com::printFLN("AdcHandle 1 ErrorCode:", AdcHandle1.ErrorCode);
        Com::printFLN("hdma_adc 1 state:", hdma_adc1.State);
        Com::printFLN("hdma_adc 1 ErrorCode:", hdma_adc1.ErrorCode);
    }
    if (numADC2) {
        Com::printFLN("AdcHandle 2 state:", AdcHandle2.State);
        Com::printFLN("AdcHandle 2 ErrorCode:", AdcHandle2.ErrorCode);
        Com::printFLN("hdma_adc 2 state:", hdma_adc2.State);
        Com::printFLN("hdma_adc 2 ErrorCode:", hdma_adc2.ErrorCode);
    }
    if (numADC3) {
        Com::printFLN("AdcHandle 3 state:", AdcHandle3.State);
        Com::printFLN("AdcHandle 3 ErrorCode:", AdcHandle3.ErrorCode);
        Com::printFLN("hdma_adc 3 state:", hdma_adc3.State);
        Com::printFLN("hdma_adc 3 ErrorCode:", hdma_adc3.ErrorCode);
    }
    Com::printFLN("dmaInitState state:", dmaInitState);
    Com::printFLN("dmaInitError ErrorCode:", dmaInitError);
    Com::printFLN("numAnalogInputs:", numAnalogInputs);
    Com::printFLN("numPWMEntries:", numPWMEntries);
    Com::printFLN("adcerror:", adcerror);
    Com::printFLN("dmaerror:", dmaerror);
    Com::printFLN("I2C Errror:", (uint16_t)i2cError);
}

void HAL::analogStart(void) {
    // Analog channels being used are already enabled. Start conversion
    // only if we have any analog sources.
    if (numAnalogInputs == 0) {
        return;
    }
    numADC1 = numADC2 = numADC3 = 0;
    for (int i = 0; i < numAnalogInputs; i++) {
        AnalogFunction& af = analogValues[i];
        if (af.def == ADC1) {
            af.dmaBufferPos = numADC1;
            numADC1++;
        }
        if (af.def == ADC2) {
            af.dmaBufferPos = numADC2;
            numADC2++;
        }
        if (af.def == ADC3) {
            af.dmaBufferPos = numADC3;
            numADC3++;
        }
    }
    ADC_ChannelConfTypeDef sConfig = { 0 };

    if (numADC1) {
        AdcHandle1.Instance = ADC1;
        AdcHandle1.State = 0;
        AdcHandle1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8;
        AdcHandle1.Init.Resolution = ADC_RESOLUTION_12B;
        AdcHandle1.Init.ScanConvMode = ENABLE;
        AdcHandle1.Init.ContinuousConvMode = ENABLE;
        AdcHandle1.Init.DiscontinuousConvMode = DISABLE;
        AdcHandle1.Init.NbrOfDiscConversion = 0;
        AdcHandle1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
        AdcHandle1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
        AdcHandle1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
        AdcHandle1.Init.NbrOfConversion = numADC1;
        AdcHandle1.Init.DMAContinuousRequests = ENABLE;
        AdcHandle1.Init.EOCSelection = DISABLE;
        if (HAL_ADC_Init(&AdcHandle1) != HAL_OK) {
            adcerror++;
            return;
        }
        sConfig.SamplingTime = numADC1 <= 6 ? ADC_SAMPLETIME_480CYCLES : ADC_SAMPLETIME_144CYCLES;
        for (int i = 0; i < numAnalogInputs; i++) {
            sConfig.Channel = analogValues[i].channel;
            sConfig.Rank = analogValues[i].dmaBufferPos + 1;
            if (HAL_ADC_ConfigChannel(&AdcHandle1, &sConfig) != HAL_OK) {
                adcerror++;
                // Error_Handler();
            }
        }
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_ADC1_CLK_ENABLE();
        __HAL_RCC_DMA2_CLK_ENABLE(); // Enable DMA2 clock

        hdma_adc1.Instance = DMA2_Stream0;
        hdma_adc1.Init.Channel = DMA_CHANNEL_0;
        hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
        hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc1.Init.MemDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc1.Init.Mode = DMA_CIRCULAR;
        hdma_adc1.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        hdma_adc1.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
        hdma_adc1.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_adc1.Init.PeriphBurst = DMA_PBURST_SINGLE;
        dmaerror
            += HAL_DMA_Init(&hdma_adc1);
        dmaInitState = hdma_adc1.State;
        dmaInitError = hdma_adc1.ErrorCode;
        __HAL_LINKDMA(&AdcHandle1, DMA_Handle, hdma_adc1);
        dmaerror += HAL_ADC_Start_DMA(&AdcHandle1, (uint32_t*)&adcData1, numADC1);
        // Just in case.
        __HAL_DMA_DISABLE_IT(&hdma_adc1, DMA_IT_HT | DMA_IT_TE | DMA_IT_TC);
    }
    if (numADC2) {
        AdcHandle2.Instance = ADC2;
        AdcHandle2.State = 0;
        AdcHandle2.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8;
        AdcHandle2.Init.Resolution = ADC_RESOLUTION_12B;
        AdcHandle2.Init.ScanConvMode = ENABLE;
        AdcHandle2.Init.ContinuousConvMode = ENABLE;
        AdcHandle2.Init.DiscontinuousConvMode = DISABLE;
        AdcHandle2.Init.NbrOfDiscConversion = 0;
        AdcHandle2.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
        AdcHandle2.Init.ExternalTrigConv = ADC_SOFTWARE_START;
        AdcHandle2.Init.DataAlign = ADC_DATAALIGN_RIGHT;
        AdcHandle2.Init.NbrOfConversion = numADC2;
        AdcHandle2.Init.DMAContinuousRequests = ENABLE;
        AdcHandle2.Init.EOCSelection = DISABLE;
        if (HAL_ADC_Init(&AdcHandle2) != HAL_OK) {
            adcerror++;
            return;
        }
        sConfig.SamplingTime = numADC2 <= 6 ? ADC_SAMPLETIME_480CYCLES : ADC_SAMPLETIME_144CYCLES;
        for (int i = 0; i < numAnalogInputs; i++) {
            sConfig.Channel = analogValues[i].channel;
            sConfig.Rank = analogValues[i].dmaBufferPos + 1;
            if (HAL_ADC_ConfigChannel(&AdcHandle2, &sConfig) != HAL_OK) {
                adcerror++;
                // Error_Handler();
            }
        }
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_ADC2_CLK_ENABLE();
        __HAL_RCC_DMA2_CLK_ENABLE(); // Enable DMA2 clock

        hdma_adc2.Instance = DMA2_Stream2;
        hdma_adc2.Init.Channel = DMA_CHANNEL_1;
        hdma_adc2.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_adc2.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_adc2.Init.MemInc = DMA_MINC_ENABLE;
        hdma_adc2.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc2.Init.MemDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc2.Init.Mode = DMA_CIRCULAR;
        hdma_adc2.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_adc2.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        hdma_adc2.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
        hdma_adc2.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_adc2.Init.PeriphBurst = DMA_PBURST_SINGLE;
        dmaerror
            += HAL_DMA_Init(&hdma_adc2);
        dmaInitState = hdma_adc2.State;
        dmaInitError = hdma_adc2.ErrorCode;
        __HAL_LINKDMA(&AdcHandle2, DMA_Handle, hdma_adc2);
        dmaerror += HAL_ADC_Start_DMA(&AdcHandle2, (uint32_t*)&adcData2, numADC2);
        // Just in case.
        __HAL_DMA_DISABLE_IT(&hdma_adc2, DMA_IT_HT | DMA_IT_TE | DMA_IT_TC);
    }
    if (numADC3) {
        AdcHandle3.Instance = ADC3;
        AdcHandle3.State = 0;
        AdcHandle3.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV8;
        AdcHandle3.Init.Resolution = ADC_RESOLUTION_12B;
        AdcHandle3.Init.ScanConvMode = ENABLE;
        AdcHandle3.Init.ContinuousConvMode = ENABLE;
        AdcHandle3.Init.DiscontinuousConvMode = DISABLE;
        AdcHandle3.Init.NbrOfDiscConversion = 0;
        AdcHandle3.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
        AdcHandle3.Init.ExternalTrigConv = ADC_SOFTWARE_START;
        AdcHandle3.Init.DataAlign = ADC_DATAALIGN_RIGHT;
        AdcHandle3.Init.NbrOfConversion = numADC3;
        AdcHandle3.Init.DMAContinuousRequests = ENABLE;
        AdcHandle3.Init.EOCSelection = DISABLE;
        if (HAL_ADC_Init(&AdcHandle3) != HAL_OK) {
            adcerror++;
            return;
        }
        sConfig.SamplingTime = numADC3 <= 6 ? ADC_SAMPLETIME_480CYCLES : ADC_SAMPLETIME_144CYCLES;
        for (int i = 0; i < numAnalogInputs; i++) {
            sConfig.Channel = analogValues[i].channel;
            sConfig.Rank = analogValues[i].dmaBufferPos + 1;
            if (HAL_ADC_ConfigChannel(&AdcHandle3, &sConfig) != HAL_OK) {
                adcerror++;
                // Error_Handler();
            }
        }
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_ADC3_CLK_ENABLE();
        __HAL_RCC_DMA2_CLK_ENABLE(); // Enable DMA2 clock

        hdma_adc3.Instance = DMA2_Stream1;
        hdma_adc3.Init.Channel = DMA_CHANNEL_2;
        hdma_adc3.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_adc3.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_adc3.Init.MemInc = DMA_MINC_ENABLE;
        hdma_adc3.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc3.Init.MemDataAlignment = DMA_PDATAALIGN_HALFWORD;
        hdma_adc3.Init.Mode = DMA_CIRCULAR;
        hdma_adc3.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_adc3.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        hdma_adc3.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
        hdma_adc3.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_adc3.Init.PeriphBurst = DMA_PBURST_SINGLE;
        dmaerror
            += HAL_DMA_Init(&hdma_adc3);
        dmaInitState = hdma_adc3.State;
        dmaInitError = hdma_adc3.ErrorCode;
        __HAL_LINKDMA(&AdcHandle3, DMA_Handle, hdma_adc3);
        dmaerror += HAL_ADC_Start_DMA(&AdcHandle3, (uint32_t*)&adcData3, numADC3);
        // Just in case.
        __HAL_DMA_DISABLE_IT(&hdma_adc3, DMA_IT_HT | DMA_IT_TE | DMA_IT_TC);
    }
}

void HAL::analogEnable(int pinId) {
    PinName pin = static_cast<PinName>(pinId);
    AnalogFunction* af = &analogValues[numAnalogInputs++];
    af->def = static_cast<ADC_TypeDef*>(pinmap_peripheral(pin, PinMap_ADC));
    if (af->def == nullptr) {
        analogMap[pinId] = nullptr;
        --numAnalogInputs;
        return;
    }
    analogMap[pinId] = af;
    af->enabled = true;
    uint32_t function = pinmap_function(pin, PinMap_ADC);
    // Set pin as analog input
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Pin = STM_LL_GPIO_PIN(pin);
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(get_GPIO_Port(STM_PORT(pin)), &GPIO_InitStruct);
    af->pin = pinId;
    af->channel = STM_PIN_CHANNEL(function);
}

