repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F4/HAL.cpp
int HAL::analogRead(int pin) {
    if (pin < 0) {
        return 0;
    }
    AnalogFunction* af = analogMap[pin];
    if (af == nullptr) { // protect for config errors
        return 0;
    }
    return af->lastValue;
}
#ifdef EEPROM_SIZE
#define SMALL_EEPROM (EEPROM_SIZE <= 0x800)
#define BIG_EEPROM (EEPROM_SIZE > 0x10000)
#else
#define SMALL_EEPROM 0
#define BIG_EEPROM 0
#endif

// Up to 3 extra bits in eeprom adress bits.
inline uint8_t eepromAddressForPosition(uint32_t pos) {
#if SMALL_EEPROM == 1
    return EEPROM_SERIAL_ADDR | ((pos >> 8) & 0x07);
#elif BIG_EEPROM == 1
    return EEPROM_SERIAL_ADDR | ((pos >> 16) & 0x07);
#else
    return EEPROM_SERIAL_ADDR;
#endif
}
void eepromWaitWhileBusy() {
#if 1
    HAL::delayMilliseconds(EEPROM_PAGE_WRITE_TIME);
#else
    do {
        WIRE_PORT.beginTransmission(EEPROM_SERIAL_ADDR);
    } while (WIRE_PORT.endTransmission());
#endif
}

#define EEPROM_DIRECT_WIRING 1
#if EEPROM_DIRECT_WIRING
static void eepromBegin(uint32_t const pos) {
    const uint8_t eepromAddress = eepromAddressForPosition(pos);
    WIRE_PORT.beginTransmission(eepromAddress);
#if (!SMALL_EEPROM)
    HAL::i2cError |= WIRE_PORT.write(uint8_t((pos >> 8) & 0xFF));
#endif
    HAL::i2cError |= WIRE_PORT.write(uint8_t(pos & 0xFF));
}
#endif

inline union eeval_t HAL::eprGetValue(unsigned int pos, int size) {
#if EEPROM_AVAILABLE == EEPROM_I2C
    eeval_t v;
#if EEPROM_DIRECT_WIRING
    eepromBegin(pos);
    uint8_t err = WIRE_PORT.endTransmission(false);
    if (Printer::feedrate == 50) {
        if (err) {
            Com::printFLN("end send adr:", (int32_t)err);
        }
    }
    err = WIRE_PORT.requestFrom(eepromAddressForPosition(pos), static_cast<uint8_t>(size), 0, 0, true);
    if (Printer::feedrate == 50) {
        if (err != size) {
            Com::printFLN("wrong rcv size:", (int32_t)err);
        }
    }
    for (int i = 0; i < size; i++) {
        // read an incomming byte
        v.b[i] = WIRE_PORT.available() ? WIRE_PORT.read() : 0xFF;
    }
    // WIRE_PORT.endTransmission();
#else
    // set read location
    i2cStartAddr(eepromAddressForPosition(pos), pos, size);
    for (int i = 0; i < size; i++) {
        // read an incomming byte
        v.b[i] = i2cRead();
    }
#endif
    return v;
#else
    eeval_t v;
    int i;
    for (i = 0; i < size; i++) {
        // read an incomming byte
        v.b[i] = 0;
    }
    return v;
#endif //(MOTHERBOARD==500) || (MOTHERBOARD==501) || (MOTHERBOARD==502)
}

// Write any data type to EEPROM
void HAL::eprBurnValue(unsigned int pos, int size, union eeval_t newvalue) {
#if EEPROM_AVAILABLE == EEPROM_I2C
#if EEPROM_DIRECT_WIRING
    eepromBegin(pos);
    WIRE_PORT.write(newvalue.b[0]);
    for (int i = 1; i < size; i++) {
        pos++;
        // writes can not cross page boundary
        if ((pos % EEPROM_PAGE_SIZE) == 0) {
            // burn current page then address next one
            WIRE_PORT.endTransmission();
            eepromWaitWhileBusy();
            eepromBegin(pos);
        }
        WIRE_PORT.write(newvalue.b[i]);
    }
    // WIRE_PORT.endTransmission();
    uint8_t err = WIRE_PORT.endTransmission();
    if (Printer::feedrate == 50) {
        if (err) {
            Com::printFLN("end write:", (int32_t)err);
        }
    }
#else
    i2cStartAddr(eepromAddressForPosition(pos), pos, 0);
    i2cWrite(newvalue.b[0]); // write first byte
    for (int i = 1; i < size; i++) {
        pos++;
        // writes can not cross page boundary
        if ((pos % EEPROM_PAGE_SIZE) == 0) {
            // burn current page then address next one
            i2cStop();
            delayMilliseconds(EEPROM_PAGE_WRITE_TIME);
            i2cStartAddr(EEPROM_SERIAL_ADDR, pos, 0);
        }
        i2cWrite(newvalue.b[i]);
    }
    i2cStop(); // signal end of transaction
#endif
    eepromWaitWhileBusy();
#elif EEPROM_AVAILABLE == EEPROM_SDCARD || EEPROM_AVAILABLE == EEPROM_FLASH
    if (pos >= EEPROM::reservedEnd) {
        eprSyncTime = 1UL; // enforce fast write to finish before power is lost
    } else {
        eprSyncTime = HAL::timeInMilliseconds() | 1UL;
    }
#endif
}

#if EEPROM_AVAILABLE == EEPROM_FLASH && EEPROM_MODE != EEPROM_NONE
millis_t eprSyncTime = 0; // in sync
void HAL::syncEEPROM() {  // store to disk if changed
    millis_t time = millis();
    if (eprSyncTime && (time - eprSyncTime > 2000)) { // Buffer writes only every 2 seconds to pool writes
        eprSyncTime = 0;
        FEUpdateChanges();
        Com::printFLN("EEPROM data updated");
    }
}
void HAL::importEEPROM() {
}
#endif
#if EEPROM_AVAILABLE == EEPROM_SDCARD

#if !SDSUPPORT
#error EEPROM using sd card requires SDCARDSUPPORT
#endif

millis_t eprSyncTime = 0; // in sync
sd_file_t eepromFile;
void HAL::syncEEPROM() {                                     // store to disk if changed
    if (eprSyncTime && (millis() - eprSyncTime > 15000ul)) { // Buffer writes only every 15 seconds to pool writes
        eprSyncTime = 0ul;
        if (sd.state < SDState::SD_MOUNTED) { // not mounted
            if (eepromFile.isOpen()) {
                eepromFile.close();
            }
            Com::printErrorFLN(PSTR("Could not write eeprom to sd card - no sd card mounted"));
            return;
        }

        if (!eepromFile.isOpen()
            || eepromFile.write(virtualEeprom, EEPROM_BYTES) != EEPROM_BYTES
            || !eepromFile.sync()) {
            Com::printErrorFLN(PSTR("Could not write eeprom to sd card"));
            sd.printIfCardErrCode();
        } else {
            eepromFile.rewind();
        }
    }
}

void HAL::importEEPROM() {
    int readBytes = 0;
    if (!eepromFile.open("eeprom.bin", O_RDWR | O_CREAT | O_SYNC)
        || ((readBytes = eepromFile.read(virtualEeprom, EEPROM_BYTES)) != EEPROM_BYTES
            && readBytes)) { // Sometimes we have a 0 byte eeprom.bin
        Com::printFLN(Com::tOpenFailedFile, PSTR("eeprom.bin"));
    }
    EEPROM::readDataFromEEPROM();
    if (eprSyncTime) {
        eprSyncTime = HAL::timeInMilliseconds() | 1UL; // Reset any sync timer
    }
}

#endif

