repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F4/HAL.cpp
    LL_TIM_ClearFlag_UPDATE(TIMER(PWM_TIMER_NUM));
    static uint8_t pwm_count0 = 0; // Used my IO_PWM_SOFTWARE!
    static uint8_t pwm_count1 = 0;
    static uint8_t pwm_count2 = 0;
    static uint8_t pwm_count3 = 0;
    static uint8_t pwm_count4 = 0;

// Add all generated pwm handlers
#undef IO_TARGET
#define IO_TARGET IO_TARGET_PWM
#include "io/redefine.h"

    counterPeriodical++;                          // Approximate a 100ms timer
    if (counterPeriodical >= PWM_COUNTER_100MS) { //  (int)(F_CPU/40960))
        counterPeriodical = 0;
        executePeriodical = 1;
    }
    pwm_count0++;
    pwm_count1 += 2;
    pwm_count2 += 4;
    pwm_count3 += 8;
    pwm_count4 += 16;

    // wait for ALL adc dma transfers to finish
    if ((numADC1 == 0 || (numADC1 && __HAL_DMA_GET_FLAG(&hdma_adc1, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc1)))) && (numADC2 == 0 || (numADC2 && __HAL_DMA_GET_FLAG(&hdma_adc2, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc2)))) && (numADC3 == 0 || (numADC3 && __HAL_DMA_GET_FLAG(&hdma_adc3, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc3))))) {
#if DEBUG_TIMING && defined(DEBUG_ISR_ANALOG_PIN) && DEBUG_ISR_ANALOG_PIN >= 0
        WRITE(DEBUG_ISR_ANALOG_PIN, 1);
#endif
        for (int i = 0; i < numAnalogInputs; i++) {
            auto& af = analogValues[i];
            if (af.def == ADC1) {
                af.lastValue = adcData1[af.dmaBufferPos];
            } else if (af.def == ADC2) {
                af.lastValue = adcData2[af.dmaBufferPos];
            } else if (af.def == ADC3) {
                af.lastValue = adcData3[af.dmaBufferPos];
            }
        }
#undef IO_TARGET
#define IO_TARGET IO_TARGET_ANALOG_INPUT_LOOP
#include "io/redefine.h"
        if (numADC1) {
            __HAL_DMA_CLEAR_FLAG(&hdma_adc1, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc1));
        }
        if (numADC2) {
            __HAL_DMA_CLEAR_FLAG(&hdma_adc2, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc2));
        }
        if (numADC3) {
            __HAL_DMA_CLEAR_FLAG(&hdma_adc3, __HAL_DMA_GET_TC_FLAG_INDEX(&hdma_adc3));
        }
#if DEBUG_TIMING && defined(DEBUG_ISR_ANALOG_PIN) && DEBUG_ISR_ANALOG_PIN >= 0
        WRITE(DEBUG_ISR_ANALOG_PIN, 0);
#endif
    }

    GUI::handleKeypress();
#if FEATURE_WATCHDOG
    if (HAL::wdPinged) {
        IWatchdog.reload();
        HAL::wdPinged = false;
    }
#endif
#if DEBUG_TIMING && defined(DEBUG_ISR_TEMP_PIN) && DEBUG_ISR_TEMP_PIN >= 0
    WRITE(DEBUG_ISR_TEMP_PIN, 0);
#endif
}

// MOTION2_TIMER IRQ handler
void TIMER_VECTOR(MOTION2_TIMER_NUM) {
#if DEBUG_TIMING && defined(DEBUG_ISR_MOTION_PIN) && DEBUG_ISR_MOTION_PIN >= 0
    WRITE(DEBUG_ISR_MOTION_PIN, 1);
#endif
    // LL_TIM_ClearFlag_UPDATE(TIMER(MOTION2_TIMER_NUM));
    Motion2::timer();
#if DEBUG_TIMING && defined(DEBUG_ISR_MOTION_PIN) && DEBUG_ISR_MOTION_PIN >= 0
    WRITE(DEBUG_ISR_MOTION_PIN, 0);
#endif
}

void HAL::spiInit() {
    SPI.begin();
}

void HAL::spiBegin(uint32_t clock, uint8_t mode, uint8_t msbfirst) {
    SPI.beginTransaction(SPISettings(clock, msbfirst ? MSBFIRST : LSBFIRST, mode));
}
uint8_t HAL::spiTransfer(uint8_t data) {
    return SPI.transfer(data);
}
void HAL::spiEnd() {
    SPI.endTransaction();
}

#if NUM_BEEPERS > 0
void toneOnTimer() {
#if DEBUG_TIMING && defined(DEBUG_ISR_TONE_PIN) && DEBUG_ISR_TONE_PIN >= 0
    WRITE(DEBUG_ISR_TONE_PIN, 1);
#endif
    bool beeperIRQPhase = true;
#undef IO_TARGET
#define IO_TARGET IO_TARGET_BEEPER_LOOP
#include "io/redefine.h"
    UNUSED(beeperIRQPhase);
#if DEBUG_TIMING && defined(DEBUG_ISR_TONE_PIN) && DEBUG_ISR_TONE_PIN >= 0
    WRITE(DEBUG_ISR_TONE_PIN, 0);
#endif
}

void toneOffTimer() {
    bool beeperIRQPhase = false;
#undef IO_TARGET
#define IO_TARGET IO_TARGET_BEEPER_LOOP
#include "io/redefine.h"
    UNUSED(beeperIRQPhase);
}
#endif

static bool toneStopped = true;
void HAL::tone(uint32_t frequency) {
#if NUM_BEEPERS > 0
#if NUM_BEEPERS > 1
    ufast8_t curPlaying = 0;
    BeeperSourceBase* playingBeepers[NUM_BEEPERS];
    // Reduce freq to nearest 100hz, otherwise we can get some insane freq multiples (from eg primes).
    // also clamp max freq.
    constexpr ufast8_t reduce = 100;
    constexpr uint32_t maxFreq = 100000;
    uint32_t multiFreq = frequency - (frequency % reduce);
    for (size_t i = 0; i < (NUM_BEEPERS + curPlaying); i++) {
        uint16_t beeperCurFreq = 0;
        if (i >= NUM_BEEPERS) {
            if (multiFreq > maxFreq) {
                multiFreq = maxFreq;
            }
            beeperCurFreq = playingBeepers[i - NUM_BEEPERS]->getCurFreq();
            beeperCurFreq -= (beeperCurFreq % reduce);
            playingBeepers[i - NUM_BEEPERS]->setFreqDiv((multiFreq / beeperCurFreq) - 1);
        } else {
            if (beepers[i]->getOutputType() == 1 && beepers[i]->isPlaying()) {
                beeperCurFreq = beepers[i]->getCurFreq();
                beeperCurFreq -= (beeperCurFreq % reduce);
                if (!multiFreq) {
                    multiFreq = beeperCurFreq;
                }
                multiFreq = RMath::LCM(multiFreq, beeperCurFreq);
                playingBeepers[curPlaying++] = beepers[i];
            }
        }
    }
    frequency = multiFreq;
#endif
    if (frequency < 1) {
        return;
    }

    uint32_t autoReload = (F_CPU_TRUE / frequency);
    uint32_t prescale = (autoReload / 0x10000) + 1;
    LL_TIM_SetPrescaler(TIMER(TONE_TIMER_NUM), prescale - 1);
    autoReload /= prescale;
    LL_TIM_SetAutoReload(TIMER(TONE_TIMER_NUM), autoReload);
    LL_TIM_OC_SetCompareCH1(TIMER(TONE_TIMER_NUM), ((autoReload + 1) * (Printer::toneVolume * 50)) / 10000);
    if (toneStopped) { // Only generate updates if the timer's dead.
        LL_TIM_GenerateEvent_UPDATE(TIMER(TONE_TIMER_NUM));
        toneStopped = false;
    }
#endif
}
void HAL::noTone() {
#if NUM_BEEPERS > 0
#if NUM_BEEPERS > 1
    // If any IO beeper is still playing, we can't stop the timer yet.
    for (size_t i = 0; i < NUM_BEEPERS; i++) {
        if (beepers[i]->getOutputType() == 1 && beepers[i]->isPlaying()) {
            HAL::tone(0);
            return;
        }
    }
#endif
    LL_TIM_SetAutoReload(TIMER(TONE_TIMER_NUM), 0);
    toneStopped = true;
#endif
}

typedef void (*pFunction)(void);
void init(void) {
    if (getBackupRegister(LL_RTC_BKP_DR2) == 0xDEADB00Dul) { // marker set - jump to boot mode
        enableBackupDomain();
        setBackupRegister(LL_RTC_BKP_DR2, 0); // clear marker, want just one time to call bootloader
        pFunction SysMemBootJump;
        HAL_RCC_DeInit();
        SysTick->CTRL = 0; // reset systick timer
        SysTick->LOAD = 0;
        SysTick->VAL = 0;
        // __disable_irq(); // disable all interrupts
        __DSB();
        // __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();
        __DSB();
        __ISB();
        // __set_PRIMASK(1);
        SysMemBootJump = (void (*)(void))(*((uint32_t*)(0x1FFF0000 + 4)));
        __set_MSP(*(__IO uint32_t*)0x1FFF0000);
        SysMemBootJump();
    }
    hw_config_init();
}

void HAL::switchToBootMode() {
    Printer::kill(false); // safety shut down hardware
    enableBackupDomain();
    setBackupRegister(LL_RTC_BKP_DR2, 0xDEADB00Dul);
    NVIC_SystemReset();
}

#endif
